Aneesh1111/StopWatch_NucleoL432KC_ESP8266NodeMCU/ESP8266_NodeMCU/server_and_UART_to_STM32/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <HardwareSerial.h>

/* global variables for server connection */
// const char *ssid = "TP-Link_5C54_asd";     // Enter SSID
// const char *password = "$$$ 6#@ h4d [\\]"; // Enter Password
const char *ssid = "ROSBOT_network";     // Enter SSID
const char *password = "ItWorksinSimulation"; // Enter Password

/* *********************************************************************************
  - To see what IP address the ESP has, run the command: nmap -sn 192.168.0.168/24*** */

// Set web server port number to 80
WiFiServer server(80);

// Variable to store the HTTP request
String header;

// Auxiliar variables to store the current output state
String output5State = "off";
String output4State = "off";

// Current time
unsigned long currentTime = millis();
// Previous time
unsigned long previousTime = 0; 
// Define timeout time in milliseconds (example: 2000ms = 2s)
const long timeoutTime = 2000;

// UART Pins
#define RX0 3
#define TX0 1
#define BUFFERSIZE 12

void setup() {
  Serial.begin(9600);
  // Set GPIO 1 and GPIO 3 as UART pins
  // pinMode(TX0, FUNCTION_1); // GPIO 1 as TX
  // pinMode(RX0, FUNCTION_1); // GPIO 3 as RX

  Serial.println("ESP8266 Initialized");

  // Connect to Wi-Fi network with SSID and password
  Serial.print("Connecting to ");
  Serial.println(ssid);
  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }
  // Print local IP address and start web server
  Serial.println("");
  Serial.println("WiFi connected.");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
  server.begin();
}

void loop(){
  WiFiClient client = server.available();   // Listen for incoming clients

  if (client) {                             // If a new client connects,
    Serial.println("New Client.");          // print a message out in the serial port
    String currentLine = "";                // make a String to hold incoming data from the client
    currentTime = millis();
    previousTime = currentTime;
    while (client.connected() && currentTime - previousTime <= timeoutTime) { // loop while the client's connected
      currentTime = millis();         
      if (client.available()) {             // if there's bytes to read from the client,
        char c = client.read();             // read a byte, then
        Serial.write(c);                    // print it out the serial monitor
        header += c;
        if (c == '\n') {                    // if the byte is a newline character
          // if the current line is blank, you got two newline characters in a row.
          // that's the end of the client HTTP request, so send a response:
          if (currentLine.length() == 0) {
            // HTTP headers always start with a response code (e.g. HTTP/1.1 200 OK)
            // and a content-type so the client knows what's coming, then a blank line:
            client.println("HTTP/1.1 200 OK");
            client.println("Content-type:text/html");
            client.println("Connection: close");
            client.println();
            
            // turns the GPIOs on and off
            if (header.indexOf("GET /5/on") >= 0) {
              // Serial.println("GPIO 5 on");
              Serial.println("1");
              output5State = "on";
            } else if (header.indexOf("GET /5/off") >= 0) {
              // Serial.println("GPIO 5 off");
              Serial.println("2");
              output5State = "off";
            } else if (header.indexOf("GET /4/on") >= 0) {
              // Serial.println("GPIO 4 on");
              Serial.println("3");
              output4State = "on";
            } else if (header.indexOf("GET /4/off") >= 0) {
              // Serial.println("GPIO 4 off");
              Serial.println("4");
              output4State = "off";
            }
            
            // Display the HTML web page
            client.println("<!DOCTYPE html><html>");
            client.println("<head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">");
            client.println("<link rel=\"icon\" href=\"data:,\">");
            // CSS to style the on/off buttons 
            // Feel free to change the background-color and font-size attributes to fit your preferences
            client.println("<style>html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: center;}");
            client.println(".button { background-color: #195B6A; border: none; color: white; padding: 16px 40px;");
            client.println("text-decoration: none; font-size: 30px; margin: 2px; cursor: pointer;}");
            client.println(".button2 {background-color: #77878A;}</style></head>");
            
            // Web Page Heading
            client.println("<body><h1>ESP8266 Web Server</h1>");
            
            // Display current state, and ON/OFF buttons for GPIO 5  
            client.println("<p>GPIO 5 - State " + output5State + "</p>");
            // If the output5State is off, it displays the ON button       
            if (output5State=="off") {
              client.println("<p><a href=\"/5/on\"><button class=\"button\">ON</button></a></p>");
            } else {
              client.println("<p><a href=\"/5/off\"><button class=\"button button2\">OFF</button></a></p>");
            } 
               
            // Display current state, and ON/OFF buttons for GPIO 4  
            client.println("<p>GPIO 4 - State " + output4State + "</p>");
            // If the output4State is off, it displays the ON button       
            if (output4State=="off") {
              client.println("<p><a href=\"/4/on\"><button class=\"button\">ON</button></a></p>");
            } else {
              client.println("<p><a href=\"/4/off\"><button class=\"button button2\">OFF</button></a></p>");
            }
            client.println("</body></html>");
            
            // The HTTP response ends with another blank line
            client.println();
            // Break out of the while loop
            break;
          } else { // if you got a newline, then clear currentLine
            currentLine = "";
          }
        } else if (c != '\r') {  // if you got anything else but a carriage return character,
          currentLine += c;      // add it to the end of the currentLine
        }
      }
    }
    // Clear the header variable
    header = "";
    // Close the connection
    client.stop();
    Serial.println("Client disconnected.");
    Serial.println("");
  }

  /* UART Receive section */
  // char receivedChars[BUFFERSIZE]; // Declare an array to store the received characters
  // int index = 0; // Initialize index to 0


  // Serial.println(Serial.available());
  // // Wait until data is available to read
  // while (Serial.available() > 0) {
  //   char incomingChar = Serial.read(); // Read the incoming character

  //   // Store the character in the array
  //   receivedChars[index] = incomingChar;

  //   // Increment the index
  //   index++;

  //   Serial.println(index);

  //   // Check if the end of the array is reached or a termination condition is met
  //   if (index >= BUFFERSIZE-1 )//|| incomingChar == '\n')
  //   {
  //     // Terminate the string with a null character
  //     receivedChars[index] = '\0';

  //     // Print the received array
  //     Serial.print("Received array: ");
  //     Serial.println(receivedChars);

  //     // Reset the index for the next array
  //     index = 0;
  //   }
  // }  
  // // Print the received array
  // // Serial.print("Received array: ");
  // // Serial.println(receivedChars);

  // delay(2000);

  // /* UART Transmit section */
  // Serial.println("abcdefjhijkl");

}
